app/Models/Karyawan/KaryawanModel.php

    public function getKaryawanByUserId($userId)
{
    return $this->where('user_id', $userId)->first();
---
SELECT *
FROM `karyawan`
WHERE `user_id` = '17'
 LIMIT 1