app/Models/Admin/KaryawanModel.php

    public function getAllKaryawan()
    {
        return $this->findAll();
---
SELECT *
FROM `karyawan`