app/Models/Admin/SesiModel.php

    public function getAllSesi()
    {
        return $this->findAll();
---
SELECT *
FROM `sesi`