app/Models/Admin/UsersModel.php

SELECT `users`.`id`, `users`.`username`, `users`.`nama`, `role`.`role` as `role`
FROM `users`
JOIN `role` ON `users`.`role_id` = `role`.`id`
WHERE `users`.`role_id` = 2
---
    public function getAlluser()
    {
        return  $this->db->table('users')
        ->select('users.id, users.username, users.nama, role.role as role')
        ->join('role', 'users.role_id = role.id')
        ->where('users.role_id', 2) // Filter di sini hanya mengambil role_id = 2
        ->get()
        ->getResultArray();