app/Controllers/AdminJamkerja.php

    public function save()
    {
        // Validasi data input
        $validation = $this->validate([
            'jam_masuk' => 'required',
            'jam_keluar' => 'required',
            'sesi'      => 'required|in_list[1,2]',
        ]);

        if (!$validation) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Simpan data ke database
        $this->sesiModel->save([
            'jam_masuk' => $this->request->getPost('jam_masuk'),
            'jam_keluar' => $this->request->getPost('jam_keluar'),
            'sesi' => $this->request->getPost('sesi'),
        ]);
---
INSERT INTO `sesi` (`jam_masuk`, `jam_keluar`, `sesi`) VALUES ('16:16', '21:16', '2')