app/Controllers/AdminKaryawan.php

            $userData['password'] = hash('sha256', sha1($password)); // Hash password
        }

        $userModel->save($userData);
---
INSERT INTO `users` (`username`, `nama`, `role_id`, `password`) VALUES ('kur', 'kur', 2, 'a4162fa552c66c999411f8097135ef66ebbf3204659edc0c286ed8f4bb593cb9')

        $userId = $userModel->getInsertID(); // Ambil ID terakhir yang di-insert

        // Simpan data karyawan
        $this->karyawanModel->save([
            'nama'          => $nama,
            'tanggal_lahir' => $tanggalLahir,
            'jabatan'       => $this->request->getPost('jabatan'),
            'alamat'        => $this->request->getPost('alamat'),
            'no_hp'         => $this->request->getPost('no_hp'),
            'jenis_kelamin' => $this->request->getPost('jenis_kelamin'),
            'status'        => $this->request->getPost('status'),
            'foto'          => $namaFoto ?? null,
            'user_id'       => $userId, // Masukkan user_id
        ]);
---
INSERT INTO `karyawan` (`nama`, `tanggal_lahir`, `jabatan`, `alamat`, `no_hp`, `jenis_kelamin`, `status`, `foto`, `user_id`) VALUES ('kur', '2002-06-23', 'Manager', 'Lampung', '083', 'Laki-laki', 'Aktif', '1745376447_50fa88340c7ea4fb38bd.jpeg', 18)

    public function deleteKaryawan($id)
    {
        $this->karyawanModel->delete(decrypt_url($id));
---
DELETE FROM `karyawan`
WHERE `id` IN ('5')