app/Controllers/KaryawanProfil.php

    public function index()
    {
        $userId = session()->get('data')['id']; // Ambil ID pengguna dari session
        // dd($userId);
        if ($userId) {
            // Ambil data pengguna dan karyawan berdasarkan user_id
            $userData = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '17'