app/Models/AuthModel.php

SELECT `users`.*, `role`.`role`
FROM `users`
LEFT JOIN `role` ON `role`.`id` = `users`.`role_id`
WHERE `username` = 'andika'
AND `password` = '29e520fe9d18620e1bacd341f8263510f937e09479deebbbeab5ab758a659270'
 LIMIT 1
---
    public function checkUser($username, $password)
    {

        // Hash yang pertama menggunakan algoritma sha-1
        // Hash yang kedua menggunakan algoritma sha256
        $hashedPassword = hash('sha256', sha1($password));

        // Query ke database untuk mencari user
        $user = $this->select('users.*, role.role') // Pilih kolom yang Anda butuhkan
            ->join('role', 'role.id = users.role_id', 'left') // Lakukan join dengan tabel role
            ->where('username', $username)
            ->where('password', $hashedPassword)
            ->first();